In [2]:
import pandas as pd
import numpy as np

stds=pd.read_csv('https://stepik.org/media/attachments/course/4852/StudentsPerformance.csv')

In [3]:
stds

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [5]:
stds.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [6]:
stds.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [8]:
stds.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [12]:
stds.groupby('gender').aggregate({'writing score':'mean'})

        writing score
gender
female      72.467181
male        63.311203

In [13]:
stds.shape

(1000, 8)

In [14]:
stds.size

8000

In [18]:
stds.iloc[[0,3,10],[-1,-2,0]]

    writing score  reading score  gender
0              74             72  female
3              44             57    male
10             52             54    male

In [20]:
stds_S=stds.iloc[[3,4,7,8]]

In [22]:
stds_S.index=["Rita",'Sergey','Ivan','Maria']

In [25]:
stds_S.loc[['Ivan']]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Ivan,male,group B,some college,free/reduced,none,40,43,39

In [27]:
stds_S.loc[['Ivan','Rita'],['gender','lunch']]

     gender         lunch
Ivan   male  free/reduced
Rita   male  free/reduced

In [31]:
type(stds.iloc[:,0])

pandas.core.series.Series

In [37]:
first_col=pd.Series([1,2,3],index=['one','two','three'])

In [38]:
second_col=pd.Series([5,5,5],index=['one','two','three'])

In [39]:
dtfrm=pd.DataFrame({'col1':first_col , 'col2':second_col})

In [41]:
dtfrm

       col1  col2
one       1     5
two       2     5
three     3     5

In [52]:
dtfrm['col1'].shape

(3,)

In [55]:
dtfrm.index

Index(['one', 'two', 'three'], dtype='object')

In [60]:
dtfrm.dtypes.value_counts()

int64    2
dtype: int64

In [63]:
dtfrm.dtypes

col1    int64
col2    int64
dtype: object

In [64]:
type(dtfrm.dtypes)

pandas.core.series.Series

In [65]:
dtfrm.columns

Index(['col1', 'col2'], dtype='object')

In [66]:
titanic_data=pd.read_csv('https://stepik.org/media/attachments/course/4852/titanic.csv')

In [67]:
titanic_data.shape

(891, 12)

In [68]:
titanic_data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [69]:
titanic_data.dtypes.value_counts()

int64      5
object     5
float64    2
dtype: int64

In [78]:
mean=stds['writing score'].mean()

In [80]:
more_mean=stds.loc[stds['writing score']>mean,['gender','writing score']]

In [81]:
more_mean

     gender  writing score
0    female             74
1    female             88
2    female             93
4      male             75
5    female             78
..      ...            ...
992  female             76
993  female             74
995  female             95
998  female             77
999  female             86

[512 rows x 2 columns]

In [84]:
more_mean_and_genderfem=stds.loc[(stds['writing score']>mean) & (stds.gender=="female"),['gender','writing score']]

In [85]:
more_mean_and_genderfem

     gender  writing score
0    female             74
1    female             88
2    female             93
5    female             78
6    female             92
..      ...            ...
992  female             76
993  female             74
995  female             95
998  female             77
999  female             86

[333 rows x 2 columns]

In [92]:
len(stds.loc[stds.lunch=='free/reduced'])/len(stds)

0.355

In [97]:
titanic_data.dtypes.value_counts()

0.355

In [104]:
stds.loc[stds.lunch=='free/reduced'].mena)

math score       15.159956
reading score    14.895339
writing score    15.433823
dtype: float64

In [103]:
stds.loc[stds.lunch=='standard'].std()

math score       13.653501
reading score    13.830602
writing score    14.339487
dtype: float64

In [105]:
stds.loc[stds.lunch=='free/reduced'].describe()

       math score  reading score  writing score
count  355.000000     355.000000     355.000000
mean    58.921127      64.653521      63.022535
std     15.159956      14.895339      15.433823
min      0.000000      17.000000      10.000000
25%     49.000000      56.000000      53.000000
50%     60.000000      65.000000      64.000000
75%     69.000000      75.000000      74.000000
max    100.000000     100.000000     100.000000

In [114]:
stds=stds.rename(columns={'math score':'math_score'})

In [116]:
stds.query("math_score > 70 & gender=='female'")

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math_score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
36,female,group D,associate's degree,standard,none,74,81,83
...,...,...,...,...,...,...,...,...
979,female,group C,associate's degree,standard,none,91,95,94
983,female,group A,some college,standard,completed,78,87,91
984,female,group C,some high school,standard,none,74,75,82
995,female,group E,master's degree,standard,completed,88,99,95
999,female,group D,some college,free/reduced,none,77,86,86

In [117]:
stds.filter(like='score')

     math_score  reading score  writing score
0            72             72             74
1            69             90             88
2            90             95             93
3            47             57             44
4            76             78             75
..          ...            ...            ...
995          88             99             95
996          62             55             55
997          59             71             65
998          68             78             77
999          77             86             86

[1000 rows x 3 columns]

In [122]:
stds.groupby(['gender','race/ethnicity'],as_index=False) \
    .agg({'math_score':'mean'}) \
    .rename(columns={'math_score':'average_math_score'})

   gender race/ethnicity  average_math_score
0  female        group A           58.527778
1  female        group B           61.403846
2  female        group C           62.033333
3  female        group D           65.248062
4  female        group E           70.811594
5    male        group A           63.735849
6    male        group B           65.930233
7    male        group C           67.611511
8    male        group D           69.413534
9    male        group E           76.746479